# "가나다라" 문자열
# 1 2 3 4 수열

#a = (1,2,3,4) 
#a = (1,2,3,4...) 무한수열
#a = (1,2,3,4...10) 유한수열
#a = 수열의 이름 
#항 = 수열의 요소
# 첫번 째 항은 1 2번째 항은 2 ~ 4번째 항은 4

#길이 = 수열의 요소의 수 4
#유한수열 : 길이가 유한한 수열
#무한수열 : 길이가 무한한 수열

순서를 나타내는 숫자 서수 first second third 첫번째 두번째
개수를 나타내는 숫자 기수 one two three 하나 둘 셋 

서수는 0부터 시작 개수는 1부터 시작 

배열 길이가 고정
리스트 배열에 요소 추가/제거등 기능 추가

a = [123, "abc", True]
a[0]

#리스트 반대로 돌리기 
a = [1,2,3,4,5]
print(a[::-1]) = [5,4,3,2,1]


# 중첩 리스트

#b = [a,a,a] = [[1,2,3,4,5],[1,2,3,4,5],[1,2,3,4,5]]
b = [[1,2,3], [4,5], [6,7]]
b[0] [1,2,3]
b[0][0] [1] #리스트가 두번 중첩되면 이렇게도 사용 가능 